In [1]:
import pandas as pd
import math
from IPython.display import display, clear_output

In [2]:
test_data = pd.read_csv("test_data.csv", sep=',', header=0)

In [3]:
train_data = pd.read_csv("train_data.csv", sep=',', header=0)

In [4]:
train_data.columns

Index(['year', 'month', 'day', 'city', 'medicine', 'sales'], dtype='object')

In [5]:
train_data.head(3)

   year  month  day  city  medicine  sales
0  2015      1    2     1         1   24.0
1  2015      1    2     1         2  144.0
2  2015      1    2     1         3   84.0

In [18]:
train_data[(train_data['year'] == 2018) & (train_data['month'] == 1) & (train_data['day'] == 1) & (train_data['city'] == 5) & (train_data['medicine'] == 5)].iloc[:,5]

Series([], Name: sales, dtype: float64)

In [19]:
train_2018 = train_data[train_data['year'] == 2018]

In [20]:
train_2018.shape

(4412026, 6)

In [22]:
train_2018_3456 = train_2018[(train_2018['month'] == 3) | (train_2018['month'] == 4) | (train_2018['month'] == 5) | (train_2018['month'] == 6)]

In [23]:
train_2018_3456.shape

(2985373, 6)

In [26]:
temp = train_2018_3456.iloc[0:5,:]

In [27]:
temp

          year  month  day  city  medicine  sales
19638972  2018      3    1     1      1292    8.0
19638973  2018      3    1     1         1    4.0
19638974  2018      3    1     1         2  104.0
19638975  2018      3    1     1         3   84.0
19638976  2018      3    1     1         4    8.0

In [32]:
def predictor(city,medicine,day):
    b = train_2018_3456[(train_2018_3456['city']==city)&(train_2018_3456['medicine']==medicine)&(train_2018_3456['day'] == day)].iloc[:,5].mean()
    return (0 if math.isnan(b) else round(b))

In [ ]:
%%time
pred_list = []
for index, row in test_data.iterrows():
    pred_list.append({"id":row['id'],"sales":predictor(row['city'],row['medicine'],row['day'])})
    clear_output(wait=True)
    print(row['id'])

In [40]:
len(pred_list)

303174

In [41]:
predictions = pd.DataFrame(pred_list)

In [42]:
predictions.to_csv('sales_predictions_a_3_1.csv', index=False)

In [2]:
sales_1 = pd.read_csv("sales_predictions_a_1.csv", sep=',', header=0)

In [3]:
sales_2 = pd.read_csv("sales_predictions_a_3_1.csv", sep=',', header=0)

In [4]:
sales_1.rename(columns={"sales": "sales_1"})
sales_2.rename(columns={"sales": "sales_2"})

            id  sales_2
0            1       17
1            2       20
2            3       77
3            4      102
4            5       19
...        ...      ...
303169  303170        4
303170  303171       15
303171  303172        0
303172  303173       51
303173  303174       34

[303174 rows x 2 columns]

In [5]:
sales_merged = pd.merge(left=sales_1, right=sales_2,how='left', left_on='id', right_on='id')

In [6]:
sales_merged['sales'] = sales_merged.iloc[:,1:3].max(axis=1)

In [7]:
sales_merged

            id  sales_x  sales_y  sales
0            1       29     17.0   29.0
1            2       13     20.0   20.0
2            3      117     77.0  117.0
3            4       80    102.0  102.0
4            5       24     19.0   24.0
...        ...      ...      ...    ...
773530  773531        0      NaN    0.0
773531  773532        0      NaN    0.0
773532  773533        0      NaN    0.0
773533  773534        0      NaN    0.0
773534  773535        0      NaN    0.0

[773535 rows x 4 columns]

In [8]:
sales_merged.drop(['sales_x', 'sales_y'], axis=1, inplace=True)

In [9]:
sales_merged

            id  sales
0            1   29.0
1            2   20.0
2            3  117.0
3            4  102.0
4            5   24.0
...        ...    ...
773530  773531    0.0
773531  773532    0.0
773532  773533    0.0
773533  773534    0.0
773534  773535    0.0

[773535 rows x 2 columns]

In [78]:
sales_merged.to_csv('sales_predictions_a_3_4.csv', index=False)

In [7]:
train_data.medicine.nunique()

3389